In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("car_data.csv")

In [3]:
df

     User ID  Gender  Age  AnnualSalary  Purchased
0        385    Male   35         20000          0
1        681    Male   40         43500          0
2        353    Male   49         74000          0
3        895    Male   40        107500          1
4        661    Male   25         79000          0
..       ...     ...  ...           ...        ...
995      863    Male   38         59000          0
996      800  Female   47         23500          0
997      407  Female   28        138500          1
998      299  Female   48        134000          1
999      687  Female   44         73500          0

[1000 rows x 5 columns]

In [4]:
df = df.drop(['User ID'],axis=1)

In [5]:
df

     Gender  Age  AnnualSalary  Purchased
0      Male   35         20000          0
1      Male   40         43500          0
2      Male   49         74000          0
3      Male   40        107500          1
4      Male   25         79000          0
..      ...  ...           ...        ...
995    Male   38         59000          0
996  Female   47         23500          0
997  Female   28        138500          1
998  Female   48        134000          1
999  Female   44         73500          0

[1000 rows x 4 columns]

In [6]:
from sklearn.preprocessing import LabelEncoder

In [7]:
le = LabelEncoder()

In [8]:
Gender = le.fit_transform(df['Gender'])

In [9]:
df = df.drop(['Gender'],axis=1)

In [10]:
df['Gender'] = Gender

In [11]:
from sklearn.model_selection import train_test_split

In [12]:
y = df["Purchased"]
X = df.drop(["Purchased"],axis=1)

In [13]:
X

     Age  AnnualSalary  Gender
0     35         20000       1
1     40         43500       1
2     49         74000       1
3     40        107500       1
4     25         79000       1
..   ...           ...     ...
995   38         59000       1
996   47         23500       0
997   28        138500       0
998   48        134000       0
999   44         73500       0

[1000 rows x 3 columns]

In [14]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

In [15]:
from sklearn.svm import SVC

In [16]:
sv = SVC()

In [17]:
sv.fit(X_train,y_train)

SVC()

In [18]:
sv.score(X_test,y_test)

0.7366666666666667

In [19]:
from sklearn.ensemble import RandomForestClassifier

In [20]:
rfc = RandomForestClassifier()

In [21]:
rfc.fit(X_train,y_train)

RandomForestClassifier()

In [22]:
rfc.score(X_test,y_test)

0.8766666666666667

In [23]:
import pickle

In [24]:
file = open("model.pkl","wb")

In [25]:
pickle.dump(rfc,file)

In [26]:
file.close()